export const versionHistory = [
{
    showUntil: '2020-11-20',
    header: '0.9.9 (2020-11-21)',
    content:
`
<ul>
    <li>оптимизации, исправления багов</li>
</ul>
`
},

{
    showUntil: '2020-11-12',
    header: '0.9.8 (2020-11-13)',
    content:
`
<ul>
    <li>добавлено окно "Оглавление/закладки"</li>
</ul>
`
},

{
    showUntil: '2020-11-11',
    header: '0.9.7 (2020-11-12)',
    content:
`
<ul>
    <li>исправления багов</li>
</ul>
`
},

{
    showUntil: '2020-11-05',
    header: '0.9.6 (2020-11-06)',
    content:
`
<ul>
    <li>завершена работа над новым окном "Библиотека"</li>
    <li>исправления багов</li>
</ul>
`
},

{
    showUntil: '2020-10-31',
    header: '0.9.5 (2020-11-01)',
    content:
`
<ul>
    <li>на панель инструментов добавлена новая кнопка "Обновить с разбиением на параграфы"</li>
    <li>исправления багов</li>
</ul>
`
},

{
    showUntil: '2020-10-28',
    header: '0.9.4 (2020-10-29)',
    content:
`
<ul>
    <li>заработал новый сайт <a href="https://liberama.top">https://liberama.top</a>, где будет более свободный обмен книгами</li>
    <li>для liberama.top добавлено новое окно: "Библиотека"</li>
    <li>исправления багов</li>
</ul>
`
},

{
    showUntil: '2020-05-20',
    header: '0.9.3 (2020-05-21)',
    content:
`
<ul>
    <li>исправления багов</li>
</ul>
`
},

{
    showUntil: '2020-04-25',
    header: '0.9.2 (2020-03-15)',
    content:
`
<ul>
    <li>в настройки добавлена возможность назначать сочетания клавиш на команды в читалке</li>
    <li>переход на Service Worker вместо AppCache для автономного режима работы</li>
    <li>исправления багов</li>
</ul>
`
},

{
    showUntil: '2020-03-02',
    header: '0.9.1 (2020-03-03)',
    content:
`
<ul>
    <li>улучшение работы серверной части</li>
    <li>незначительные изменения интерфейса</li>
</ul>
`
},

{
    showUntil: '2020-02-25',
    header: '0.9.0 (2020-02-26)',
    content:
`
<ul>
    <li>переход на UI-фреймфорк Quasar</li>
    <li>незначительные изменения интерфейса</li>
</ul>
`
},

{
    showUntil: '2020-02-05',
    header: '0.8.4 (2020-02-06)',
    content:
`
<ul>
    <li>добавлен paypal-адрес для пожертвований</li>
    <li>исправления багов</li>
</ul>
`
},

{
    showUntil: '2020-01-27',
    header: '0.8.3 (2020-01-28)',
    content:
`
<ul>
    <li>добавлено всплывающее окно с акцией "Оплатим хостинг вместе"</li>
    <li>внутренние оптимизации</li>
</ul>
`
},

{
    showUntil: '2020-01-19',
    header: '0.8.2 (2020-01-20)',
    content:
`
<ul>
    <li>внутренние оптимизации</li>
</ul>
`
},

{
    showUntil: '2020-01-06',
    header: '0.8.1 (2020-01-07)',
    content:
`
<ul>
    <li>добавлена частичная поддержка формата FB3</li>
    <li>исправлен баг "Request path contains unescaped characters"</li>
</ul>
`
},

{
    showUntil: '2020-01-05',
    header: '0.8.0 (2020-01-02)',
    content:
`
<ul>
    <li>окончательный переход на https</li>
    <li>код проекта теперь Open Source: <a href="https://github.com/bookpauk/liberama" target="_blank">https://github.com/bookpauk/liberama</a></li>
</ul>
`
},

{
    showUntil: '2019-11-26',
    header: '0.7.9 (2019-11-27)',
    content:
`
<ul>
    <li>добавлен неубираемый баннер для http-версии о переходе на httpS</li>
    <li>исправления багов</li>
</ul>
`
},

{
    showUntil: '2019-11-24',
    header: '0.7.8 (2019-11-25)',
    content:
`
<ul>
    <li>улучшение html-фильтров для сайтов</li>
    <li>исправления багов</li>
</ul>
`
},

{
    showUntil: '2019-11-10',
    header: '0.7.7 (2019-11-06)',
    content:
`
<ul>
    <li>добавлены следующие жесты для тачскрина (только при включенной опции "управление кликом"):</li>
    <ul>
        <li style="list-style-type: square">от центра вверх: на весь экран</li>
        <li style="list-style-type: square">от центра вниз: плавный скроллинг</li>
        <li style="list-style-type: square">от центра вправо: увеличить скорость скроллинга</li>
        <li style="list-style-type: square">от центра влево: уменьшить скорость скроллинга</li>
    </ul>
</ul>
`
},

{
    showUntil: '2019-10-29',
    header: '0.7.6 (2019-10-30)',
    content:
`
<ul>
    <li>исправления багов</li>
</ul>
`
},

{
    showUntil: '2019-10-21',
    header: '0.7.5 (2019-10-22)',
    content:
`
<ul>
    <li>исправления багов</li>
</ul>
`
},

{
    showUntil: '2019-10-17',
    header: '0.7.3 (2019-10-18)',
    content:
`
<ul>
    <li>внутренние переделки механизма синхронизации с сервером</li>
    <li>добавлен html-фильтр для сайтов www.fanfiction.net, archiveofourown.org</li>
    <li>добавлен параметр "Включить html-фильтр для сайтов" в раздел "Вид"->"Текст" в настройках</li>
    <li>исправления багов</li>
</ul>
`
},

{
    showUntil: '2019-09-19',
    header: '0.7.1 (2019-09-20)',
    content:
`
<ul>
    <li>исправления багов</li>
    <li>на панель управления добавлена кнопка "Автономный режим"</li>
    <li>актуализирована справка</li>
</ul>
`
},

{
    showUntil: '2019-10-01',
    header: '0.7.0 (2019-09-07)',
    content:
`
<ul>
    <li>налажена работа https-версии сайта, рекомендуется плавный переход</li>
    <li>добавлена возможность загрузки и работы https-версии читалки в оффлайн-режиме (при отсутствии интернета)</li>
    <li>упрощение механизма серверной синхронизации с целью повышения надежности и избавления от багов</li>
    <li>окна теперь можно перемещать за заголовок</li>
    <li>немного улучшен внешний вид и управление на смартфонах</li>
    <li>добавлен параметр "Компактность" в раздел "Вид"->"Текст" в настройках</li>
</ul>
`
},

{
    showUntil: '2019-07-20',
    header: '0.6.10 (2019-07-21)',
    content:
`
<ul>
    <li>исправления багов</li>
</ul>
`
},

{
    showUntil: '2019-06-22',
    header: '0.6.9 (2019-06-23)',
    content:
`
<ul>
    <li>исправлен баг - падение сервера при распаковке битых архивов книг</li>
    <li>исправлен баг - не распознавались некоторые книги формата fb2 в кодировке utf8</li>
    <li>добавлены новые варианты анимации перелистывания</li>
    <li>на страницу загрузки добавлен блок "Поделиться"</li>
    <li>улучшены прогрессбары</li>
    <li>исправления недочетов, небольшие оптимизации</li>
</ul>
`
},

{
    showUntil: '2019-06-05',
    header: '0.6.7 (2019-05-30)',
    content:
`
<ul>
    <li>добавлен диалог "Что нового"</li>
    <li>в справку добавлена история версий проекта</li>
    <li>добавлена возможность настройки отображаемых кнопок на панели управления</li>
    <li>некоторые кнопки на панели управления были скрыты по умолчанию</li>
    <li>на страницу загрузки добавлена возможность загрузки книги из буфера обмена</li>
    <li>добавлен GET-параметр вида "/reader?__refresh=1&url=..." для принудительного обновления загружаемого текста</li>
    <li>добавлен GET-параметр вида "/reader?__pp=50.5&url=..." для указания позиции в книге в процентах</li>
    <li>исправления багов и недочетов</li>
</ul>
`
},

{
    showUntil: '2019-03-29',
    header: '0.6.6 (2019-03-29)',
    content:
`
<ul>
    <li>в справку добавлено описание настройки браузеров для автономной работы читалки (без доступа к интернету)</li>
    <li>оптимизации процесса синхронизации, внутренние переделки</li>
</ul>
`
},

{
    showUntil: '2019-03-24',
    header: '0.6.4 (2019-03-24)',
    content:
`
<ul>
    <li>исправления багов, оптимизации</li>
    <li>добавлена возможность синхронизации данных между устройствами</li>
</ul>
`
},

{
    showUntil: '2019-03-04',
    header: '0.5.4 (2019-03-04)',
    content:
`
<ul>
    <li>добавлена поддержка форматов pdf, epub, mobi</li>
    <li>(0.5.2) добавлена поддержка форматов rtf, doc, docx</li>
    <li>(0.4.2) фильтр для СИ больше не вырезает изображения</li>
    <li>(0.4.0) добавлено отображение картинок в fb2</li>
</ul>
`
},

{
    showUntil: '2019-02-17',
    header: '0.3.0 (2019-02-17)',
    content:
`
<ul>
    <li>поправки багов</li>
    <li>улучшено распознавание текста</li>
    <li>изменена верстка страницы - убрано позиционирование каждого слова</li>
</ul>
`
},

{
    showUntil: '2019-02-14',
    header: '0.1.7 (2019-02-14)',
    content:
`
<ul>
    <li>увеличены верхние границы отступов и др.размеров</li>
    <li>добавлена настройка для удаления/вставки пустых параграфов</li>
    <li>добавлена настройка включения/отключения управления кликом</li>
    <li>добавлена возможность сброса настроек</li>
    <li>убран автоматический редирект на последнюю загруженную книгу, если не задан url в маршруте</li>
</ul>
`
},

{
    showUntil: '2019-02-12',
    header: '0.1.0 (2019-02-12)',
    content:
`
<ul>
    <li>первый деплой проекта, длительность разработки - 2 месяца</li>
</ul>
`
},

]