export const versionHistory = [
{
    showUntil: '2019-06-05',
    header: '0.6.7 (2019-)',
    content:
`
<ul>
    <li>добавлен диалог "Что нового"</li>
    <li>в справку добавлена история версий проекта</li>
    <li>добавлена возможность настройки отображаемых кнопок на панели управления</li>
    <li>некоторые кнопки на панели управления были скрыты по-умолчанию</li>
    <li>на страницу загрузки добавлена возможность загрузки книги из буфера обмена</li>
    <li>исправления багов и недочетов</li>
</ul>
`
},

{
    showUntil: '2019-03-29',
    header: '0.6.6 (2019-03-29)',
    content:
`
<ul>
    <li>в справку добавлено описание настройки браузеров для автономной работы читалки (без доступа к интернету)</li>
    <li>оптимизации процесса синхронизации, внутренние переделки</li>
</ul>
`
},

{
    showUntil: '2019-03-24',
    header: '0.6.4 (2019-03-24)',
    content:
`
<ul>
    <li>исправления багов, оптимизации</li>
    <li>добавлена возможность синхронизации данных между устройствами</li>
</ul>
`
},

{
    showUntil: '2019-03-04',
    header: '0.5.4 (2019-03-04)',
    content:
`
<ul>
    <li>добавлена поддержка форматов pdf, epub, mobi</li>
    <li>(0.5.2) добавлена поддержка форматов rtf, doc, docx</li>
    <li>(0.4.2) фильтр для СИ больше не вырезает изображения</li>
    <li>(0.4.0) добавлено отображение картинок в fb2</li>
</ul>
`
},

{
    showUntil: '2019-02-17',
    header: '0.3.0 (2019-02-17)',
    content:
`
<ul>
    <li>поправки багов</li>
    <li>улучшено распознавание текста</li>
    <li>изменена верстка страницы - убрано позиционирование каждого слова</li>
</ul>
`
},

{
    showUntil: '2019-02-14',
    header: '0.1.7 (2019-02-14)',
    content:
`
<ul>
    <li>увеличены верхние границы отступов и др.размеров</li>
    <li>добавлена настройка для удаления/вставки пустых параграфов</li>
    <li>добавлена настройка включения/отключения управления кликом</li>
    <li>добавлена возможность сброса настроек</li>
    <li>убран автоматический редирект на последнюю загруженную книгу, если не задан url в маршруте</li>
</ul>
`
},

{
    showUntil: '2019-02-12',
    header: '0.1.0 (2019-02-12)',
    content:
`
<ul>
    <li>первый деплой проекта, длительность разработки - 2 месяца</li>
</ul>
`
},

]